# PathReinforcementManyLoops Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..PathReinforcementManyLoops Property
BuiltInFailures..::..SketchFailures Class See Also
---
Sketch contains more than one chain. Can't create Path Reinforcement.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId PathReinforcementManyLoops { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PathReinforcementManyLoops As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ PathReinforcementManyLoops {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace